{
  "home": "Accueil",
  "about": "À propos de moi",
  "year": "Année",
  "projects": "Projets",
  "contact": "Contact",
  "selectLanguage": "Choisir la langue",
  "greeting": "Alberto Villegas Chaparro",
  "aboutMeButton": "Voir plus sur moi",
  "contactMeButton": "Me contacter",
  "introText": "Explorez mon portfolio pour découvrir mes projets, compétences et comment je peux apporter de la valeur grâce à des solutions créatives, fonctionnelles et centrées sur l’utilisateur.",
  "concreteFeatures": "Caractéristiques concrètes",
  "developmentTitle": "Développement de logiciels multiplateformes",
  "developmentDescription": "Spécialisé dans la création d'applications web et mobiles en utilisant des frameworks.",
  "developmentLabel": "En savoir plus sur le développement multiplateforme",
  "programmingTitle": "Compétences en programmation",
  "programmingDescription": "Connaissance de plusieurs langages de programmation pour le développement web et multiplateforme, permettant la création de sites web, etc.",
  "programmingLabel": "En savoir plus sur les compétences en programmation",
  "databaseTitle": "Gestion de bases de données",
  "databaseDescription": "Expérience dans la gestion de serveurs de bases de données à travers divers projets développés au fil des années.",
  "databaseLabel": "En savoir plus sur la gestion des bases de données",
  "name": "Alberto Villegas",
  "profession": "Développeur Full Stack",
  "tooltipGithub": "GitHub",
  "tooltipLinkedIn": "LinkedIn",
  "tooltipEmail": "Email",
  "tooltipTwitter": "X / Twitter",
  "academicDataTitle": "Éducation",
  "academicDataDescription": "Détails et aperçu de mes études, ainsi que les <strong>établissements éducatifs</strong> où je les ai complétées.",
  "academicInstitutions": "établissements éducatifs",
  "floridaUni": "Florida Universitaria, Catarroja",
  "webDevDegree": "Diplôme Supérieur en Développement d’Applications Web",
  "multiPlatformDevDegree": "Diplôme Supérieur en Développement d’Applications Multiplateformes",
  "microSystemsDegree": "Diplôme de Technicien en Systèmes Micro-informatiques et Réseaux",
  "period1": "Septembre 2024 - Juin 2025",
  "period2": "Septembre 2022 - Juin 2024",
  "period3": "Septembre 2020 - Juin 2022",
  "aboutTitle": "À propos de moi",
  "aboutDescriptionFirst": "Je suis un développeur full stack junior, passionné par l'apprentissage continu et le développement aussi bien frontend que backend. J’ai de l’expérience avec divers outils, technologies et frameworks, toujours axé sur l’utilisabilité et le design centré sur l’utilisateur.",
  "aboutDescriptionSecond": "Mon objectif est de combiner créativité et technique pour développer des produits numériques qui ne se contentent pas de fonctionner correctement, mais qui séduisent aussi leurs utilisateurs.",
  "downloadCV": "Télécharger le CV",
  "projectsTitle": "Mes Projets",
  "projectsDescription": "Voici une sélection de mes projets, réalisés individuellement ou en équipe. Explorez-les pour en savoir plus sur mon travail.",
  "viewDemo": "Voir la démo",
  "viewGitHub": "Voir sur GitHub",
  "viewMore": "Voir plus",
  "skills": "Compétences",
  "contactTitle": "Contactez-moi !",
  "contactDescription": "C’est l’occasion idéale pour me contacter via ce formulaire. Je répondrai à vos questions dès que possible.",
  "namePlaceholder": "Prénom",
  "lastNamePlaceholder": "Nom de famille",
  "emailPlaceholder": "Adresse e-mail",
  "emailHelpText": "Nous vous enverrons un message d'information.",
  "phonePlaceholder": "Numéro de téléphone",
  "messagePlaceholder": "Message d'information",
  "acceptTermsLabel": "Accepter les termes et conditions",
  "sendButton": "Envoyer",
  "rightsReserved": "Copyright 2025 Alberto Villegas Chaparro. Tous droits réservés.",
  "nameLanguages": {
    "french": "Français",
    "spanish": "Espagnol",
    "english": "Anglais"
  },
  "projectsCard": {
    "list": [
      {
        "title": "Albertours",
        "description": "Application web réalisée avec PHP pour la gestion des réservations de circuits touristiques dans différentes villes d’Espagne. Elle permet d’explorer les circuits disponibles, de faire ou d’annuler des réservations et de consulter les informations détaillées de chaque tour."
      },
      {
        "title": "Roma8",
        "description": "Application web et mobile développée avec Quasar pour la gestion ou l’administration d’une propriété. Ce projet a été réalisé avec un camarade de classe."
      },
      {
        "title": "Application jeu mémoire",
        "description": "Application Java du jeu de mémoire utilisant MongoDB comme base de données. Elle permet aux utilisateurs de s’enregistrer, se connecter et jouer en choisissant différents niveaux de difficulté. Elle enregistre les temps, résultats et records, selon le modèle de conception MVC."
      },
      {
        "title": "Hotel Estrellas",
        "description": "Application de gestion de réservations de chambres offrant une expérience client complète. Inclut une version mobile avec des informations sur les services comme le restaurant, la piscine ou la salle de sport, et permet de chercher, explorer et réserver rapidement et en toute sécurité. Projet d'équipe."
      },
      {
        "title": "App Nourriture",
        "description": "Application web de gestion de plats qui permet de consulter des données via une API REST publique et de stocker les informations dans sa propre base de données. Elle utilise aussi des technologies pour la recherche de plats et la gestion de la base."
      },
      {
        "title": "Templator",
        "description": "Intégration d’un éditeur HTML WYSIWYG appelé Summernote pour créer et gérer des modèles HTML destinés à l’envoi d’e-mails."
      },
      {
        "title": "Logiciel Fitness",
        "description": "Application pour le développement d’une plateforme web permettant de gérer efficacement un club de fitness et d’améliorer l’expérience des utilisateurs."
      }
    ]
  }
}
